<?php

return [

    /*
    |--------------------------------------------------------------------------
    | HTTP Language Lines
    |--------------------------------------------------------------------------
    |
    | The following language lines are used in the views/errors files.
    |
    */

    '404' => [
        'title'       => 'صفحة غير متوفرة',
        'description' => 'نعتذر ولكن الصفحة المطلوبة غير موجودة.',
    ],

    '503' => [
        'title'       => 'خطأ سيرفر داخلي',
        'description' => 'سيتم إصلاح الخطأ و العودة لوضع التشغيل بأقرب فرصة ممكنة.',
    ],
];
